//
// File: RM65_rena.cpp
//
// MATLAB Coder version            : 5.5
// C/C++ source code generated on  : 03-Feb-2026 17:43:16
//

// Include Files
#include "RM65_rena.h"
#include "RM65_rena_types.h"
#include "standard_regressor_RM65.h"
#include <algorithm>
#include <cmath>
#include <cstring>

// Function Declarations
namespace RM65Lib {
static int div_nzp_s32(int numerator);

}

// Function Definitions
//
// Arguments    : int numerator
// Return Type  : int
//
namespace RM65Lib {
static int div_nzp_s32(int numerator)
{
  int quotient;
  unsigned int tempAbsQuotient;
  if (numerator < 0) {
    tempAbsQuotient = ~static_cast<unsigned int>(numerator) + 1U;
  } else {
    tempAbsQuotient = static_cast<unsigned int>(numerator);
  }
  tempAbsQuotient /= 66U;
  if (numerator < 0) {
    quotient = -static_cast<int>(tempAbsQuotient);
  } else {
    quotient = static_cast<int>(tempAbsQuotient);
  }
  return quotient;
}

//
// ---------------------------------------------------------------------
//  该函数用于计算机器人在特定运动状态下的预测力矩
//
//  输入参数:
//    qi       - 关节位置向量 (6x1)
//    qdi      - 滤波后的关节速度向量 (6x1)
//    q2di     - 估算的关节加速度向量 (6x1)
//    baseQR   - 包含机器人结构信息的结构体 (由 base_params_qr 生成)
//    pi_b     - 辨识出的机器人基参数 (Base Parameters)
//    pi_fr    - 辨识出的摩擦力参数 (Friction Parameters)
//
//  输出参数:
//    tau_pred - 预测的关节力矩向量 (6x1, 单位: Nm)
//  ---------------------------------------------------------------------
//
// Arguments    : const double q[6]
//                const double qd[6]
//                const double q2d[6]
//                const structbaseQR_T *baseQR
//                const structsol_T *sol
//                double tau_pred[6]
// Return Type  : void
//
void RM65_rena(const double q[6], const double qd[6], const double q2d[6],
               const structbaseQR_T *baseQR, const structsol_T *sol,
               double tau_pred[6])
{
  double b_Ybi_data[504];
  double Ybi_data[396];
  double Yi[396];
  double Y_rgd_bdy[360];
  double b_q2d[354];
  double Yfrctni[108];
  double b_sol[60];
  double Y_mtrs[36];
  double t10;
  double t11;
  double t110;
  double t112;
  double t12;
  double t122;
  double t123;
  double t124;
  double t125;
  double t126;
  double t127;
  double t128;
  double t129;
  double t13;
  double t130;
  double t131;
  double t133;
  double t134;
  double t135;
  double t15;
  double t156;
  double t16;
  double t160;
  double t161;
  double t162;
  double t166;
  double t167;
  double t178;
  double t18;
  double t190;
  double t192;
  double t193;
  double t196;
  double t2;
  double t20;
  double t201;
  double t210;
  double t211;
  double t212;
  double t216;
  double t216_tmp;
  double t217;
  double t219;
  double t222;
  double t223;
  double t224;
  double t226;
  double t227;
  double t228;
  double t228_tmp_tmp;
  double t229;
  double t231;
  double t231_tmp_tmp;
  double t232;
  double t235;
  double t238;
  double t240;
  double t243;
  double t245;
  double t247;
  double t248;
  double t249;
  double t256;
  double t264;
  double t268;
  double t269;
  double t275;
  double t278;
  double t279;
  double t285;
  double t289;
  double t292;
  double t295;
  double t296;
  double t297;
  double t299;
  double t3;
  double t30;
  double t302;
  double t303;
  double t31;
  double t311;
  double t312;
  double t313;
  double t314;
  double t31_tmp;
  double t32;
  double t327;
  double t328;
  double t329;
  double t34;
  double t340;
  double t341;
  double t342;
  double t344;
  double t345;
  double t346;
  double t349;
  double t352;
  double t373;
  double t375;
  double t377;
  double t377_tmp;
  double t383;
  double t384;
  double t385;
  double t386;
  double t388;
  double t39;
  double t392;
  double t397;
  double t4;
  double t40;
  double t402;
  double t403;
  double t404;
  double t405;
  double t406;
  double t407;
  double t408;
  double t409;
  double t41;
  double t412;
  double t42;
  double t43;
  double t44;
  double t443;
  double t445;
  double t45;
  double t46;
  double t491;
  double t5;
  double t520;
  double t53;
  double t54;
  double t548;
  double t55;
  double t56;
  double t56_tmp;
  double t57;
  double t58;
  double t59;
  double t6;
  double t60;
  double t61;
  double t63;
  double t63_tmp;
  double t64;
  double t64_tmp;
  double t68;
  double t69;
  double t7;
  double t70;
  double t73;
  double t74;
  double t76;
  double t78;
  double t8;
  double t9;
  double t92;
  double t96;
  double t97;
  int coffset;
  int i;
  int nc;
  //  包含电机反射惯量的模型 (6x66 矩阵)
  //  ----------------------------------------------------------------------
  //  This function adds motor dynamics to rigid body regressor.
  //  It is simplified model of motor dynamics, it adds only reflected
  //  inertia i.e. I_rflctd = Im*N^2 where N is reduction ratio - I_rflctd*q_2d
  //  parameter is added to existing vector of each link [pi_i I_rflctd_i]
  //  so that each link has 11 parameters
  //  ----------------------------------------------------------------------
  // standard_regressor_RM65
  //     Y_f = standard_regressor_RM65(IN1,IN2,IN3)
  //     This function was generated by the Symbolic Math Toolbox version 9.2.
  //     02-Feb-2026 16:39:05
  t2 = std::cos(q[0]);
  t3 = std::cos(q[1]);
  t4 = std::cos(q[2]);
  t5 = std::cos(q[3]);
  t6 = std::cos(q[4]);
  t7 = std::cos(q[5]);
  t8 = std::sin(q[0]);
  t9 = std::sin(q[1]);
  t10 = std::sin(q[2]);
  t11 = std::sin(q[3]);
  t12 = std::sin(q[4]);
  t13 = std::sin(q[5]);
  t15 = qd[1] + qd[2];
  t16 = qd[0] * qd[0];
  t18 = t5 * t5;
  t20 = t11 * t11;
  t275 = t5 * t12;
  t30 = t275 * 0.21;
  t31_tmp = t6 * t11;
  t31 = t31_tmp * 0.21;
  t32 = t275 * 0.105;
  t34 = q2d[3] * -3.6732051033465739E-6;
  t39 = t3 * -3.6732051033465739E-6;
  t40 = t4 * -3.6732051033465739E-6;
  t41 = t9 * -3.6732051033465739E-6;
  t42 = t3 * 0.99999999999325373;
  t43 = t10 * -3.6732051033465739E-6;
  t44 = t4 * 0.99999999999325373;
  t45 = t9 * 0.99999999999325373;
  t46 = t10 * 0.99999999999325373;
  t56_tmp = t5 * t6;
  t56 = t56_tmp * 0.99999999999325373;
  t57 = t6 * t7 * 0.99999999999325373;
  t58 = t275 * 0.99999999999325373;
  t59 = t31_tmp * 0.99999999999325373;
  t60 = t6 * t13 * 0.99999999999325373;
  t275 = t7 * t12;
  t61 = t275 * 0.99999999999325373;
  t63_tmp = t11 * t12;
  t63 = t63_tmp * 0.99999999999325373;
  t64_tmp = t12 * t13;
  t64 = t64_tmp * 0.99999999999325373;
  t73 = t5 * t15 * 0.99999999999325373;
  t74 = t11 * t15 * 0.99999999999325373;
  t92 = t5 * 0.99999999999325373 * 0.21;
  t96 = t11 * 0.99999999999325373 * 0.21;
  t110 = t7 * -3.6732051033465739E-6 * 0.161;
  t112 = t2 * 0.99999999999325373 * 9.81;
  t10 = t8 * 0.99999999999325373 * 9.81;
  t124 = t6 * -3.6732051033465739E-6 * 0.99999999999325373;
  t125 = t7 * -3.6732051033465739E-6 * 0.99999999999325373;
  t128 = t12 * -3.6732051033465739E-6 * 0.99999999999325373;
  t129 = t13 * -3.6732051033465739E-6 * 0.99999999999325373;
  t53 = t5 * 0.99999999998650746;
  t54 = t6 * 0.99999999998650746;
  t55 = t9 * 0.99999999998650746;
  t68 = t58 * 2.0;
  t69 = t59 * 2.0;
  t70 = t61 * 2.0;
  t76 = t7 * t11 * 0.99999999997976119;
  t78 = t11 * t13 * 0.99999999997976119;
  t97 = t45 * 0.256;
  t123 = 0.99999999999325373 * t39;
  t126 = t11 * 0.99999999998650746 * 0.161;
  t127 = 0.99999999999325373 * t41;
  t130 = t2 * t39 * 9.81;
  t131 = t2 * t41 * 9.81;
  t133 = t56 * 0.161;
  t134 = t8 * t41 * 9.81;
  t135 = t59 * 0.161;
  t156 = -3.6732051033465739E-6 * t56;
  t9 = -3.6732051033465739E-6 * t57;
  t160 = -3.6732051033465739E-6 * t58;
  t161 = -3.6732051033465739E-6 * t59;
  t162 = -3.6732051033465739E-6 * t60;
  t166 = -3.6732051033465739E-6 * t63;
  t167 = -3.6732051033465739E-6 * t64;
  t178 = t43 + t44;
  t196 = t124 * 0.161;
  t201 = t128 * 0.161;
  t216_tmp = t63_tmp * -3.6732051033465739E-6;
  t216 = t56_tmp * 0.21 + t216_tmp * -0.21;
  t217 = t63_tmp * 0.21 + t56_tmp * -3.6732051033465739E-6 * -0.21;
  t342 = t10 + t2 * -3.6732051033465739E-6 * 0.99999999999325373 * -9.81;
  t122 = t53 * 0.161;
  t190 = t41 + t3 * 0.99999999998650746;
  t192 = t40 - t46;
  t210 = t160 * 0.161;
  t211 = t30 + -3.6732051033465739E-6 * t31;
  t212 = t31 + -3.6732051033465739E-6 * t30;
  t219 = t166 * -0.161;
  t222 = qd[1] * t178 * 0.256;
  t226 = t42 + t127;
  t235 = t43 * 0.256 + t44 * 0.256;
  t245 = t58 + t161;
  t268 = -3.6732051033465739E-6 * t216;
  t269 = 0.99999999999325373 * t216;
  t289 = t13 * -3.6732051033465739E-6 * t217;
  t4 = t64_tmp * 0.99999999998650746;
  t295 = t110 + t4 * 0.161;
  t296 = t7 * -3.6732051033465739E-6 * 0.0805 + t4 * 0.0805;
  t340 = t112 + -3.6732051033465739E-6 * t10;
  t346 = -3.6732051033217936E-6 * t178 * 0.256;
  t385 = (t59 - t128) + t160;
  t386 = (t61 - t129) + t162;
  t392 = t11 * 0.99999999999325373 * t342;
  t193 = (t53 + 1.3492435731251315E-11) * (t53 + 1.3492435731251315E-11);
  t223 = t7 * t211;
  t224 = t13 * t211;
  t227 = t45 + 0.99999999999325373 * -t39;
  t228_tmp_tmp = qd[1] * t5;
  t4 = t228_tmp_tmp * t192;
  t228 = t4 * 0.128;
  t229 = t4 * 0.256;
  t231_tmp_tmp = qd[1] * t11;
  t4 = t231_tmp_tmp * t192;
  t231 = t4 * 0.128;
  t232 = t4 * 0.256;
  t238 = t8 * t190 * 9.81;
  t240 = t40 * 0.256 - t46 * 0.256;
  t243 = t7 * 0.99999999999325373 * (t53 + 1.3492435731251315E-11);
  t247 = t12 * 0.99999999999325373 * (t53 + 1.3492435731251315E-11);
  t248 = t13 * 0.99999999999325373 * (t53 + 1.3492435731251315E-11);
  t249 = t13 * 0.99999999999325373 * (t54 + 1.3492435731251315E-11);
  t256 = t56 - t166;
  t264 = 0.99999999999325373 * t211;
  t285 = t7 * t268;
  t4 = qd[1] * 0.99999999999325373 * t192;
  t297 = t4 * 0.128;
  t299 = t4 * 0.256;
  t4 = t5 * -3.6732051033465739E-6 * t192;
  t302 = t4 * 0.128;
  t303 = t4 * 0.256;
  t4 = t275 * 0.99999999998650746;
  t313 = t13 * -3.6732051033465739E-6 * 0.161 - t4 * 0.161;
  t314 = t13 * -3.6732051033465739E-6 * 0.0805 - t4 * 0.0805;
  t4 = t54 * t192;
  t327 = t4 * 0.128;
  t328 = t53 * t192 * 0.256;
  t329 = t4 * 0.256;
  t4 = (qd[1] * 0.21 + qd[2] * 0.21) + t222;
  t341 = t42 * 0.2405 + t127 * 0.2405;
  t344 = t7 * -3.6732051033465739E-6 * t245;
  t345 = t13 * -3.6732051033465739E-6 * t245;
  t352 = t126 + t212;
  t373 = -3.6732051033465739E-6 * t340;
  t375 = t178 * t226;
  t377_tmp = t39 - t55;
  t377 = t134 + t2 * t377_tmp * -9.81;
  t383 = (t63 + t124) - t156;
  t384 = (t64 + t125) - t9;
  t388 = t192 * t226;
  t397 = t385 * t385;
  t402 = (t63 * 2.0 + t124 * 2.0) + t156 * -2.0;
  t403 = (t64 * 2.0 + t125 * 2.0) + t9 * -2.0;
  t404 = (t69 - t128 * 2.0) + -3.6732051033465739E-6 * t68;
  t405 = (t70 - t129 * 2.0) + t162 * 2.0;
  t407 = t7 * t385;
  t412 = t13 * t385;
  t443 = (t92 + t133) + t219;
  t445 = (t122 + 2.172282152731462E-12) + t216;
  t491 = (t63 * 0.161 + t196) + t156 * -0.161;
  t520 = t211 * t385;
  t548 = ((t96 + t135) - t201) + t210;
  t10 = t7 * t256;
  t275 = t13 * t256;
  t278 = -3.6732051033465739E-6 * t223;
  t279 = -3.6732051033465739E-6 * t224;
  t292 = t264 / 2.0;
  t311 = t5 * (t235 + 0.21);
  t312 = t11 * (t235 + 0.21);
  t349 = t5 * t4;
  t4 *= t11;
  t30 = t375 * 2.0;
  t64 = qd[0] * t375;
  t125 = t178 * t227;
  t162 = t388 * 2.0;
  t129 = t383 * t383;
  t406 = t7 * t383;
  t408 = t13 * t383;
  t409 = t192 * t227;
  b_q2d[0] = q2d[0];
  b_q2d[1] = q2d[1];
  b_q2d[2] = q2d[2];
  b_q2d[3] = q2d[3];
  b_q2d[4] = q2d[4];
  b_q2d[5] = q2d[5];
  b_q2d[6] = qd[0];
  b_q2d[7] = qd[1];
  b_q2d[8] = qd[2];
  b_q2d[9] = qd[3];
  b_q2d[10] = qd[4];
  b_q2d[11] = qd[5];
  b_q2d[12] = t18 * 0.99999999999325373 * 0.21;
  b_q2d[13] = t20 * 0.99999999999325373 * 0.21;
  b_q2d[14] = 2.172282152731462E-12;
  b_q2d[15] = t11;
  b_q2d[16] = t12;
  b_q2d[17] = -t112;
  b_q2d[18] = t122;
  b_q2d[19] = t124;
  b_q2d[20] = t126;
  b_q2d[21] = t128;
  b_q2d[22] = t13;
  b_q2d[23] = t130;
  b_q2d[24] = t131;
  b_q2d[25] = t133;
  b_q2d[26] = t134;
  b_q2d[27] = t135;
  b_q2d[28] = q2d[1] + q2d[2];
  b_q2d[29] = -t128;
  b_q2d[30] = t15;
  b_q2d[31] = t11 * -3.6732051033465739E-6 * 0.99999999998650746;
  b_q2d[32] = q2d[1] * t5 * -3.6732051033465739E-6 * 0.99999999999325373 * 2.0;
  b_q2d[33] = q2d[2] * t5 * -3.6732051033465739E-6 * 0.99999999999325373 * 2.0;
  t3 = q2d[1] * t11;
  b_q2d[34] = t3 * -3.6732051033465739E-6 * 0.99999999999325373 * 2.0;
  t41 = q2d[2] * t11;
  b_q2d[35] = t41 * -3.6732051033465739E-6 * 0.99999999999325373 * 2.0;
  b_q2d[36] = t156;
  b_q2d[37] = t16;
  b_q2d[38] = t160;
  b_q2d[39] = t161;
  b_q2d[40] = t166;
  b_q2d[41] = qd[1] * qd[1];
  b_q2d[42] = t178;
  b_q2d[43] = -t156;
  b_q2d[44] = t18;
  b_q2d[45] = -t166;
  b_q2d[46] = t53 + 1.3492435731251315E-11;
  b_q2d[47] = t54 + 1.3492435731251315E-11;
  b_q2d[48] = t123 * 0.256;
  b_q2d[49] = t7 * t7;
  b_q2d[50] = t127 * 0.256;
  b_q2d[51] = t192;
  b_q2d[52] = q2d[4] * (t53 + 1.3492435731251315E-11);
  b_q2d[53] = t196;
  b_q2d[54] = t192 * t192;
  b_q2d[55] = t2;
  b_q2d[56] = t20;
  b_q2d[57] = t201;
  b_q2d[58] = t8 * -3.6732051033465739E-6 * 0.99999999999325373 * -9.81;
  b_q2d[59] = -t201;
  b_q2d[60] = q2d[1] * t193;
  b_q2d[61] = q2d[2] * t193;
  b_q2d[62] = t12 * t12;
  b_q2d[63] = t210;
  b_q2d[64] = t211;
  b_q2d[65] = t212;
  b_q2d[66] = t32 + t31_tmp * -3.6732051033465739E-6 * 0.105;
  b_q2d[67] = t216;
  b_q2d[68] = t217;
  b_q2d[69] = t56_tmp * 0.105 - t216_tmp * 0.105;
  b_q2d[70] = t219;
  b_q2d[71] = t13 * t13;
  b_q2d[72] = t12 * 0.99999999998650746 * t110;
  b_q2d[73] = t222;
  b_q2d[74] = t223;
  b_q2d[75] = t224;
  b_q2d[76] = t226;
  b_q2d[77] = t227;
  b_q2d[78] = t228;
  b_q2d[79] = t229;
  b_q2d[80] = t231;
  b_q2d[81] = t232;
  b_q2d[82] = t13 * (t54 + 1.3492435731251315E-11) * 0.161;
  b_q2d[83] = t226 * t226;
  b_q2d[84] = t235;
  b_q2d[85] = -3.6732051033465739E-6 * (t53 + 1.3492435731251315E-11);
  b_q2d[86] = t238;
  b_q2d[87] = t34 * (t53 + 1.3492435731251315E-11);
  b_q2d[88] = t240;
  b_q2d[89] = t227 * t227;
  b_q2d[90] = t6 * 0.99999999999325373 * (t53 + 1.3492435731251315E-11);
  b_q2d[91] = t7 * 0.99999999999325373 * (t54 + 1.3492435731251315E-11);
  b_q2d[92] = t245;
  b_q2d[93] = t60 + -3.6732051033465739E-6 * t61;
  b_q2d[94] = t247;
  b_q2d[95] = t248;
  b_q2d[96] = t249;
  b_q2d[97] = -3.6732051033465739E-6;
  b_q2d[98] = t248 * 2.0;
  b_q2d[99] = -t243;
  b_q2d[100] = -(t243 * 2.0);
  b_q2d[101] = t256;
  b_q2d[102] = t68 + -3.6732051033465739E-6 * t69;
  b_q2d[103] = t57 - t167;
  b_q2d[104] = -t247;
  b_q2d[105] = 0.99999999999325373;
  b_q2d[106] = -t249;
  b_q2d[107] = t5 * t240;
  b_q2d[108] = t11 * t240;
  b_q2d[109] = t264;
  b_q2d[110] = t56 * 2.0 + t166 * -2.0;
  b_q2d[111] = t57 * 2.0 + t167 * -2.0;
  b_q2d[112] = t269;
  b_q2d[113] = qd[4] * 0.161;
  b_q2d[114] = 0.99999999999325373 * t217;
  b_q2d[115] = qd[1] * 0.99999999999325373 * t178 * 0.128;
  b_q2d[116] = qd[0] * t226 * 0.256;
  b_q2d[117] = 0.99999999999325373 * t222;
  b_q2d[118] = t275;
  b_q2d[119] = t5 * -3.6732051033465739E-6 * t178 * 0.256;
  b_q2d[120] = t278;
  b_q2d[121] = t279;
  b_q2d[122] = t12 * t264;
  b_q2d[123] = -t264;
  b_q2d[124] = t10 * 2.0;
  b_q2d[125] = t275 * 2.0;
  b_q2d[126] = -(t11 * -3.6732051033465739E-6 * t178 * 0.256);
  b_q2d[127] = t285;
  b_q2d[128] = t7 * -3.6732051033465739E-6 * t217;
  b_q2d[129] = t6 * t269;
  b_q2d[130] = t13 * t268;
  b_q2d[131] = t289;
  b_q2d[132] = t228_tmp_tmp * -3.6732051033465739E-6 * t178 * 0.128;
  b_q2d[133] = t5 * -3.6732051033465739E-6 * t222;
  b_q2d[134] = t292;
  b_q2d[135] = t295;
  b_q2d[136] = t296;
  b_q2d[137] = t297;
  b_q2d[138] = qd[0] * t227 * 0.256;
  b_q2d[139] = t299;
  b_q2d[140] = -t10;
  b_q2d[141] = t302;
  b_q2d[142] = t303;
  t9 = t11 * -3.6732051033465739E-6 * t192;
  b_q2d[143] = t9 * 0.128;
  b_q2d[144] = t9 * 0.256;
  b_q2d[145] = t54 * t178 * 0.256;
  b_q2d[146] = t12 * 0.99999999998650746 * t178 * 0.256;
  b_q2d[147] = -t292;
  t9 = t231_tmp_tmp * -3.6732051033465739E-6 * t178;
  b_q2d[148] = -(t9 * 0.128);
  b_q2d[149] = t9 * -0.256;
  b_q2d[150] = t311;
  b_q2d[151] = t312;
  b_q2d[152] = t313;
  b_q2d[153] = t314;
  b_q2d[154] = -t297;
  b_q2d[155] = -t299;
  b_q2d[156] = -t302;
  b_q2d[157] = -t303;
  b_q2d[158] = -t285;
  b_q2d[159] = t32;
  b_q2d[160] = t278 / 2.0;
  b_q2d[161] = -t289;
  b_q2d[162] = t279 / 2.0;
  b_q2d[163] = -3.6732051033465739E-6 * t228;
  b_q2d[164] = -3.6732051033465739E-6 * t229;
  b_q2d[165] = -3.6732051033465739E-6 * t231;
  b_q2d[166] = -3.6732051033465739E-6 * t232;
  b_q2d[167] = t327;
  b_q2d[168] = t328;
  b_q2d[169] = t329;
  t9 = t12 * 0.99999999998650746 * t192;
  b_q2d[170] = t9 * 0.128;
  b_q2d[171] = t11 * 0.99999999998650746 * t192 * 0.256;
  b_q2d[172] = t9 * 0.256;
  b_q2d[173] = -t327;
  b_q2d[174] = -t328;
  b_q2d[175] = -t329;
  b_q2d[176] = t311 / 2.0;
  b_q2d[177] = t312 / 2.0;
  b_q2d[178] = 0.99999999999325373 * t245;
  b_q2d[179] = t34;
  b_q2d[180] = t341;
  b_q2d[181] = t45 * 0.2405 - t123 * 0.2405;
  b_q2d[182] = t344;
  b_q2d[183] = t345;
  b_q2d[184] = t346;
  b_q2d[185] = t344 * 2.0;
  b_q2d[186] = t345 * 2.0;
  b_q2d[187] = t349;
  b_q2d[188] = q2d[4] * -3.6732051033465739E-6;
  b_q2d[189] = -t346;
  b_q2d[190] = -3.6732051033217936E-6 * t192 * 0.128;
  b_q2d[191] = -3.6732051033217936E-6 * t192 * 0.256;
  b_q2d[192] = -t4;
  b_q2d[193] = t7 * t295 * 0.0805;
  b_q2d[194] = t7 * t296 * 0.161;
  b_q2d[195] = t349 / 2.0;
  b_q2d[196] = 1.3492435731251315E-11;
  b_q2d[197] = t4 / 2.0;
  b_q2d[198] = t341 + 0.256;
  b_q2d[199] = t13 * t313 * 0.0805;
  b_q2d[200] = t13 * t314 * 0.161;
  b_q2d[201] = t7 * t352;
  b_q2d[202] = t13 * t352;
  b_q2d[203] = -3.6732051033465739E-6 * t313;
  b_q2d[204] = t7 * 0.99999999999325373 * t295;
  b_q2d[205] = t13 * 0.99999999999325373 * t313;
  b_q2d[206] = 0.99999999998650746;
  b_q2d[207] = (t53 + 1.3492435731251315E-11) * t211;
  b_q2d[208] = (t53 + 1.3492435731251315E-11) * t216;
  b_q2d[209] = t8 * t39 * 9.81 + t2 * t190 * 9.81;
  b_q2d[210] = t373;
  b_q2d[211] = t375;
  b_q2d[212] = -3.6732051033465739E-6 * t342;
  b_q2d[213] = t30;
  b_q2d[214] = t64;
  b_q2d[215] = t5 * 0.99999999999325373 * t340;
  b_q2d[216] = t11 * 0.99999999999325373 * t340;
  b_q2d[217] = -t373;
  b_q2d[218] = t383;
  b_q2d[219] = t384;
  b_q2d[220] = t385;
  b_q2d[221] = t386;
  b_q2d[222] = t388;
  b_q2d[223] = t125;
  b_q2d[224] = t39;
  b_q2d[225] = qd[0] * t30;
  b_q2d[226] = t5 * 0.99999999999325373 * t342;
  b_q2d[227] = t392;
  b_q2d[228] = t31 * 0.99999999998650746 + -3.6732051033465739E-6 * t211;
  b_q2d[229] = t162;
  b_q2d[230] = t125 * 2.0;
  b_q2d[231] = qd[0] * t388;
  b_q2d[232] = qd[0] * t125;
  b_q2d[233] = t40;
  b_q2d[234] = q2d[4] * t385;
  b_q2d[235] = t402;
  b_q2d[236] = t403;
  b_q2d[237] = t404;
  b_q2d[238] = t405;
  b_q2d[239] = t406;
  b_q2d[240] = t407;
  b_q2d[241] = t408;
  b_q2d[242] = t409;
  b_q2d[243] = -t125;
  b_q2d[244] = t412;
  b_q2d[245] = qd[0] * t162;
  b_q2d[246] = -t392;
  b_q2d[247] = t63_tmp * 0.99999999998650746 * -0.21 + t268;
  b_q2d[248] = q2d[1] * t129;
  b_q2d[249] = q2d[2] * t129;
  b_q2d[250] = t406 * 2.0;
  b_q2d[251] = q2d[1] * t397;
  b_q2d[252] = q2d[2] * t397;
  b_q2d[253] = t407 * 2.0;
  b_q2d[254] = t408 * 2.0;
  b_q2d[255] = t409 * 2.0;
  b_q2d[256] = t412 * 2.0;
  b_q2d[257] = qd[0] * t409;
  b_q2d[258] = -(q2d[4] * t383);
  b_q2d[259] = t43;
  b_q2d[260] = t375 * 0.21;
  b_q2d[261] = t64 * 0.21;
  b_q2d[262] = t388 * 0.21;
  b_q2d[263] = t44;
  b_q2d[264] = t7 * t384 * 0.161;
  b_q2d[265] = 0.99999999999325373 * t383;
  b_q2d[266] = -(t13 * t386 * 0.161);
  b_q2d[267] = -3.6732051033465739E-6 * t407;
  b_q2d[268] = -3.6732051033465739E-6 * t412;
  b_q2d[269] = t13 * 0.99999999999325373 * t384;
  b_q2d[270] = t16 * t226 * t227;
  b_q2d[271] = qd[0] * qd[1] * t226 * t227 * 2.0;
  b_q2d[272] = t46;
  b_q2d[273] = t178 * t341;
  b_q2d[274] = t7 * t445;
  b_q2d[275] = t13 * t445;
  b_q2d[276] = -(q2d[3] * t12 * 0.99999999999325373 * t385);
  b_q2d[277] = t15 * -3.6732051033465739E-6;
  b_q2d[278] = -3.6732051033465739E-6 * t402 / 2.0;
  b_q2d[279] = -3.6732051033465739E-6 * t403 / 2.0;
  b_q2d[280] = -3.6732051033465739E-6 * t404 / 2.0;
  b_q2d[281] = -3.6732051033465739E-6 * t405 / 2.0;
  b_q2d[282] = t192 * t341;
  b_q2d[283] = q2d[3] * t5 * 0.99999999999325373;
  b_q2d[284] = t6 * 0.99999999999325373 * t404 / 2.0;
  b_q2d[285] = t7 * 0.99999999999325373 * t405 / 2.0;
  b_q2d[286] = t96 * t383;
  b_q2d[287] = t96 * t385;
  b_q2d[288] = -3.6732051033465739E-6 * t443;
  b_q2d[289] = q2d[3] * t11 * 0.99999999999325373;
  b_q2d[290] = t7 * 0.99999999999325373 * t443;
  b_q2d[291] = t13 * 0.99999999999325373 * t443;
  t9 = t130 - t238;
  b_q2d[292] = -t178 * t9;
  b_q2d[293] = t5;
  b_q2d[294] = q2d[1] * 1.3492435731251315E-11;
  b_q2d[295] = t178 * t377;
  b_q2d[296] = -t192 * t9;
  t275 = t131 + t8 * t377_tmp * 9.81;
  b_q2d[297] = -t178 * t275;
  b_q2d[298] = t192 * t377;
  b_q2d[299] = q2d[2] * 1.3492435731251315E-11;
  b_q2d[300] = -t192 * t275;
  b_q2d[301] = t178 * t275;
  t4 = q2d[1] * (t53 + 1.3492435731251315E-11);
  b_q2d[302] = t4 * t402;
  t10 = q2d[2] * (t53 + 1.3492435731251315E-11);
  b_q2d[303] = t10 * t402;
  b_q2d[304] = t4 * t404;
  b_q2d[305] = t10 * t404;
  b_q2d[306] = t520;
  b_q2d[307] = -3.6732051033465739E-6 * t491;
  b_q2d[308] = t216 * t383;
  b_q2d[309] = t53;
  b_q2d[310] = -t520;
  b_q2d[311] = t7 * 0.99999999999325373 * t491;
  b_q2d[312] = t13 * 0.99999999999325373 * t491;
  b_q2d[313] = t54;
  b_q2d[314] = t55;
  b_q2d[315] = t56;
  b_q2d[316] = -3.6732051033465739E-6 * t548;
  b_q2d[317] = t7 * 0.99999999999325373 * t548;
  b_q2d[318] = t13 * 0.99999999999325373 * t548;
  b_q2d[319] = t58;
  b_q2d[320] = t59;
  b_q2d[321] =
      (t64_tmp * -3.6732051033465739E-6 * 0.99999999998650746 * -0.161 +
       t7 * (t54 + 1.3492435731251315E-11) * 0.161) +
      -3.6732051033465739E-6 * t295;
  b_q2d[322] = q2d[1] * t383 * t404;
  b_q2d[323] = q2d[2] * t383 * t404;
  b_q2d[324] = t6;
  b_q2d[325] = t60;
  b_q2d[326] = t63;
  b_q2d[327] = t7;
  b_q2d[328] = t70;
  b_q2d[329] = t74;
  b_q2d[330] = t76;
  b_q2d[331] = t74 * 2.0;
  b_q2d[332] = t78;
  b_q2d[333] = q2d[1] * t18 * 0.99999999998650746;
  b_q2d[334] = t8;
  b_q2d[335] = q2d[2] * t18 * 0.99999999998650746;
  b_q2d[336] = q2d[1] * t20 * 0.99999999998650746;
  t9 = t192 * t275 + t178 * t9;
  b_q2d[337] = -t11 * t9;
  b_q2d[338] = q2d[2] * t20 * 0.99999999998650746;
  b_q2d[339] = -t5 * t9;
  b_q2d[340] = -t73;
  b_q2d[341] = t11 * t9;
  b_q2d[342] = -(t73 * 2.0);
  b_q2d[343] = t76 * 2.0;
  b_q2d[344] = t78 * 2.0;
  b_q2d[345] = t3 * t53 * 2.0;
  b_q2d[346] = t41 * t53 * 2.0;
  b_q2d[347] = t5 * -3.6732051033465739E-6 * 0.21;
  b_q2d[348] = t11 * -3.6732051033465739E-6 * 0.21;
  b_q2d[349] = t92;
  b_q2d[350] = t42 * 0.256;
  b_q2d[351] = t96;
  b_q2d[352] = t97;
  b_q2d[353] = -t97;
  ft_1(b_q2d, Y_rgd_bdy);
  std::memset(&Y_mtrs[0], 0, 36U * sizeof(double));
  for (int j{0}; j < 6; j++) {
    Y_mtrs[j + 6 * j] = q2d[j];
  }
  std::copy(&Y_rgd_bdy[0], &Y_rgd_bdy[60], &Yi[0]);
  for (i = 0; i < 6; i++) {
    Yi[i + 60] = Y_mtrs[i];
  }
  std::copy(&Y_rgd_bdy[60], &Y_rgd_bdy[120], &Yi[66]);
  for (i = 0; i < 6; i++) {
    Yi[i + 126] = Y_mtrs[i + 6];
  }
  std::copy(&Y_rgd_bdy[120], &Y_rgd_bdy[180], &Yi[132]);
  for (i = 0; i < 6; i++) {
    Yi[i + 192] = Y_mtrs[i + 12];
  }
  std::copy(&Y_rgd_bdy[180], &Y_rgd_bdy[240], &Yi[198]);
  for (i = 0; i < 6; i++) {
    Yi[i + 258] = Y_mtrs[i + 18];
  }
  std::copy(&Y_rgd_bdy[240], &Y_rgd_bdy[300], &Yi[264]);
  for (i = 0; i < 6; i++) {
    Yi[i + 324] = Y_mtrs[i + 24];
  }
  std::copy(&Y_rgd_bdy[300], &Y_rgd_bdy[360], &Yi[330]);
  for (i = 0; i < 6; i++) {
    Yi[i + 390] = Y_mtrs[i + 30];
  }
  //  2. 将全参数回归矩阵映射到基参数空间
  //  使用置换矩阵的索引截取前 n 个独立列
  if (baseQR->numberOfBaseParameters < 1) {
    nc = 0;
  } else {
    nc = baseQR->numberOfBaseParameters;
  }
  for (int j{0}; j < nc; j++) {
    int boffset;
    coffset = j * 6;
    boffset = j * 66;
    for (int b_i{0}; b_i < 6; b_i++) {
      Ybi_data[coffset + b_i] = 0.0;
    }
    for (int k{0}; k < 66; k++) {
      int aoffset;
      aoffset = k * 6;
      i = boffset + k;
      t4 = baseQR->permutationMatrix[i % 66 + 66 * div_nzp_s32(i)];
      for (int b_i{0}; b_i < 6; b_i++) {
        i = coffset + b_i;
        Ybi_data[i] += Yi[aoffset + b_i] * t4;
      }
    }
  }
  //  3. 计算摩擦力回归矩阵
  //  通常包含库伦摩擦和粘性摩擦项
  //  ----------------------------------------------------------------------
  //  The function computes friction regressor for each joint of the robot.
  //  Fv*qd + Fc*sign(qd) + F0, and the second one is continous,
  //  ---------------------------------------------------------------------
  std::memset(&Yfrctni[0], 0, 108U * sizeof(double));
  for (int b_i{0}; b_i < 6; b_i++) {
    i = 3 * (b_i + 1) - 3;
    t4 = qd[b_i];
    Yfrctni[b_i + 6 * i] = t4;
    Yfrctni[b_i + 6 * (i + 1)] = std::tanh(t4 / 0.01);
    Yfrctni[b_i + 6 * (i + 2)] = 1.0;
  }
  //  4. 合成总回归矩阵并乘以辨识出的参数向量
  //  tau = [惯性与重力项  摩擦项] * [基参数; 摩擦参数]
  for (i = 0; i < nc; i++) {
    for (int j{0}; j < 6; j++) {
      coffset = j + 6 * i;
      b_Ybi_data[coffset] = Ybi_data[coffset];
    }
  }
  for (i = 0; i < 18; i++) {
    for (int j{0}; j < 6; j++) {
      b_Ybi_data[j + 6 * (i + nc)] = Yfrctni[j + 6 * i];
    }
  }
  std::copy(&sol->pi_b[0], &sol->pi_b[42], &b_sol[0]);
  std::copy(&sol->pi_fr[0], &sol->pi_fr[18], &b_sol[42]);
  for (i = 0; i < 6; i++) {
    t4 = 0.0;
    for (int j{0}; j < 60; j++) {
      t4 += b_Ybi_data[i + 6 * j] * b_sol[j];
    }
    tau_pred[i] = t4;
  }
}

} // namespace RM65Lib

//
// File trailer for RM65_rena.cpp
//
// [EOF]
//
